# Вводится список целых чисел в одну строчку через пробел. Необходимо оставить в нем только двузначные числа.
# Реализовать программу с использованием функции filter. Результат отобразить на экране в виде последовательности
# оставшихся чисел в одну строчку через пробел.

# Начальные данные - список целых чисел
# list = [1,2,3,4,22,234,24]


user_list = input("Введите список чисел, разделенных пробелом: ").split()
list_int = map(int, user_list)


# Основная программа:
print(f'Начальный список:\n {user_list}')
print('Отфильтрованный по признаку двузначности список:')
print(*filter(lambda x: 9<abs(x)<100,list_int))